## Project: Data Cleaning with Pandas

#### Below will be a series of user stories, followed by an empty Python code block
* These user stories will go through the process of importing, cleaning, and exporting the included `dirty_cars_dataset.csv` file
* Be sure to read each question carefully, and to test and debug your code to ensure the user story is completed correctly!

### As a Data Analyst, I want to set up the proper imports so I have access to the Pandas library

In [2]:
import pandas as pd

### As a Data Analyst, I want to import and store the `dirty_cars_dataset.csv` file in a variable
âœ… I want to use the `index` column from this .csv file as the `index column` of my DataFrame

In [3]:
dirty_cars_dataset = pd.read_csv('dirty_cars_dataset.csv', index_col='index')

### As a Data Analyst, I want to view the **information** about my new DataFrame to answer the following questions:
##### Enter your responses in the Markdown block below

* How many entries are in this DataFrame: 64
* How many columns are in this DataFrame: 9
* Which column(s) contain null values in this DataFrame: price

In [4]:
dirty_cars_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 64 entries, 0 to 88
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company           64 non-null     object
 1   body-style        64 non-null     object
 2   wheel-base        64 non-null     float64
 3   length            64 non-null     float64
 4   engine-type       64 non-null     object
 5   num-of-cylinders  64 non-null     object
 6   horsepower        64 non-null     int64
 7   average-mileage   64 non-null     int64
 8   price             61 non-null     float64
dtypes: float64(3), int64(2), object(4)
memory usage: 5.0+ KB

### As a Data Analyst, I want to to remove any null values from the DataFrame
âœ… I want to **create a new DataFrame variable** when I remove these null values<br>
âœ… Then, I want to display the **information** about my new DataFrame, to confirm the null values were successfully removed

In [5]:
nulls_removed_cars_ds = dirty_cars_dataset.dropna()
nulls_removed_cars_ds.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 0 to 88
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company           61 non-null     object
 1   body-style        61 non-null     object
 2   wheel-base        61 non-null     float64
 3   length            61 non-null     float64
 4   engine-type       61 non-null     object
 5   num-of-cylinders  61 non-null     object
 6   horsepower        61 non-null     int64
 7   average-mileage   61 non-null     int64
 8   price             61 non-null     float64
dtypes: float64(3), int64(2), object(4)
memory usage: 4.8+ KB

### As a Data Analyst, I want to check if there are any **duplicate rows** within my DataFrame

In [6]:
nulls_removed_cars_ds.duplicated()

index
0     False
1     False
2     False
3     False
4     False
      ...
82    False
83     True
86    False
87    False
88    False
Length: 61, dtype: bool

### As a Data Analyst, I want to **remove** any duplicate values from the DataFrame
âœ… I want to **create a new DataFrame variable** when I remove these duplicate values<br>
âœ… I want to again check if there are any duplicate rows within my DataFrame, to ensure the values were removed successfully

In [7]:
no_nulls_no_duplicates_cars_ds = nulls_removed_cars_ds.drop_duplicates()
no_nulls_no_duplicates_cars_ds.duplicated()

index
0     False
1     False
2     False
3     False
4     False
5     False
6     False
9     False
10    False
11    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
26    False
28    False
29    False
30    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
43    False
44    False
45    False
46    False
47    False
48    False
50    False
51    False
52    False
53    False
54    False
55    False
56    False
57    False
61    False
62    False
66    False
67    False
68    False
69    False
70    False
71    False
79    False
80    False
81    False
82    False
86    False
87    False
88    False
dtype: bool

### As a Data Analyst, I want to ensure I remove any outlier values from my DataFrame to avoid inaccurate analysis of my data
âœ…I want to **create a new DataFrame variable** when I remove these values<br><br>
ðŸ’¡ **Hint:** These inaccuracies will be within the `price` column ðŸ’¡<br><br>
ðŸ’¡ **Hint** There will be both **high** and **low** outlier values ðŸ’¡

In [8]:
# Removing high outlier values
no_nulls_no_duplicates_cars_ds.sort_values(by=['price'], ascending=False).head()
clean_car_ds = no_nulls_no_duplicates_cars_ds.drop(2)
clean_car_ds.sort_values(by=['price'], ascending=False).head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

In [9]:
# Removing low outlier values
clean_car_ds = clean_car_ds.drop(53)
clean_car_ds.sort_values(by=['price'], ascending=True).head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
48,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0

### As a Data Analyst, I want to reformat the **company** series, ensuring all company name values are properly title (Pascal) cased

In [10]:
clean_car_ds['company'] = clean_car_ds['company'].str.title()
clean_car_ds.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
3,Audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,Audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,Audi,sedan,99.8,177.3,ohc,five,110,19,15250.0

### As a Data Analyst, I want to create a ***new*** column on my DataFrame to represent the **price of each car in Euros**
ðŸ’¡ **Use the conversion rate 1.05 USD == 1 Euro** ðŸ’¡

In [11]:
clean_car_ds['Price in Euros(â‚¬)'] = clean_car_ds['price']*1.05
clean_car_ds.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,Price in Euros(â‚¬)
index,,,,,,,,,,
0,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,14169.75
1,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,17325.00
3,Audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,14647.50
4,Audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,18322.50
5,Audi,sedan,99.8,177.3,ohc,five,110,19,15250.0,16012.50

### As a Data Analyst, I want to rename the existing **price** column to show that it represents **price in USD**

In [16]:
clean_car_ds = clean_car_ds.rename(columns={'USD($)': 'Price in USD($)'})
clean_car_ds.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,Price in USD($),Price in Euros(â‚¬)
index,,,,,,,,,,
0,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,13495.0,14169.75
1,Alfa-Romero,convertible,88.6,168.8,dohc,four,111,21,16500.0,17325.00
3,Audi,sedan,99.8,176.6,ohc,four,102,24,13950.0,14647.50
4,Audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,18322.50
5,Audi,sedan,99.8,177.3,ohc,five,110,19,15250.0,16012.50

### As a Data Analyst, I want to output my cleaned DataFrame as a .csv file
âœ… I want to name this file `cleaned_cars_dataset.csv`<br>
âœ… I want to specify the encoding type 'utf-8'<br>
âœ… I want to include this .csv file in my GitHub repository

In [13]:
clean_car_ds.to_csv('clean_cars_dataset.csv', encoding='utf-8')